Revit 2026 API

# RepeaterBoundsGetLowerBound Method

---

Returns the smallest index of the array in the given dimension.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public int GetLowerBound(
	int dimension
)
```
```vb
Public Function GetLowerBound (
	dimension As Integer
) As Integer
```
```cpp
public:
int GetLowerBound(
	int dimension
)
```
```fsharp
member GetLowerBound :
        dimension : int -> int
```

#### Parameters

dimension Int32
     The dimension.

#### Return Value

Int32 The smallest index of the array in the given dimension.

| Exception | Condition |
| --- | --- |
| ArgumentException | The dimension is invalid for these bounds. |
| InvalidOperationException | The bounds must have at least one dimension. |

The dimension begins at 0 and must be in the range [0, number of dimensions in the bounds - 1]. This method does not apply to zero dimensional bounds.

#### Reference

RepeaterBounds Class

Autodesk.Revit.DB Namespace